var config = {
	"unit": 10,
	"limit": 2,
	"space": 1,
	"id": "seatarea",
};
var seat = {
	"row": 1,
	"col": 1,
	"x": 1,
	"y": 1,
	"w": 4,
	"h": 4,
	"status": 0, //0 可选; 1 不可选; 2 已选中
	"type": 0,
};

var mockData = [
	{
		"row": 1,
		"col": 1,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 1,
		"col": 2,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 1,
		"col": 3,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 1,
		"col": 5,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 1,
		"col": 6,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 2,
		"col": 1,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 2,
		"col": 2,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 2,
		"col": 3,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 2,
		"col": 5,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 2,
		"col": 6,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 3,
		"col": 1,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 3,
		"col": 2,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 3,
		"col": 3,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 3,
		"col": 5,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 3,
		"col": 6,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 4,
		"col": 1,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 2, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 4,
		"col": 2,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 4,
		"col": 3,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 4,
		"col": 5,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 4,
		"col": 6,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 5,
		"col": 1,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 5,
		"col": 2,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 5,
		"col": 3,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 5,
		"col": 5,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 5,
		"col": 6,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 6,
		"col": 1,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 6,
		"col": 2,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 6,
		"col": 3,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 6,
		"col": 5,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 6,
		"col": 6,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 7,
		"col": 1,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 7,
		"col": 2,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 7,
		"col": 3,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 7,
		"col": 5,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 7,
		"col": 6,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 8,
		"col": 1,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 8,
		"col": 2,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 8,
		"col": 3,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 8,
		"col": 5,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 1, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}, {
		"row": 8,
		"col": 6,
		// "x": 1,
		// "y": 1,
		"w": 4,
		"h": 4,
		"status": 0, //0 可选; 1 不可选; 2 已选中
		"type": 0,
	}
];